app/views/books/index.html.erb

SELECT "categories".id FROM "categories" INNER JOIN "books_categories" ON "categories"."id" = "books_categories"."category_id" WHERE "books_categories"."book_id" = ?  [["book_id", 9]]
---
        <td><%= book.description %></td>
        <td><%= book.categories.map {|category| category.name}.join(', ') %></td>