app/controllers/books_controller.rb

  def index
    @books = Book.where('(draft=? OR user_id=?) AND DATE(created_at) >= ?', false, current_user.id, Date.today - 7.days )
---
SELECT "books".* FROM "books" WHERE ((draft='f' OR user_id=1) AND DATE(created_at) >= '2017-06-22')

  def new
    @book = Book.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def edit
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @book = current_user.books.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "draft", "author", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["draft", "f"], ["author", ""], ["description", ""], ["user_id", 2], ["created_at", "2017-06-29 20:06:10.078166"], ["updated_at", "2017-06-29 20:06:10.078166"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "preview_file_name" = ?, "preview_file_size" = ?, "preview_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["preview_file_name", "0.jpg"], ["preview_file_size", 8457], ["preview_updated_at", "2017-06-28 21:18:31.276623"], ["updated_at", "2017-06-28 21:18:32.076918"], ["id", 3]]

  def destroy
    @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]

  def set_book
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 3]]